Revit 2027 API
AnalyticalSurfaceBase.SketchId Property
 Sketch associated to this Revit element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SketchId { get; }
Public ReadOnly Property SketchId As ElementId
	Get
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
member SketchId : ElementId with get
Property Value
ElementId
Remarks
 Analytical Element may not have a valid sketch. To edit the sketch profile you can use SetOuterContour(CurveLoop) or [!:Autodesk::Revit::DB::SketchEditScope].
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace